{"040ddc06-50cb-4319-b3f6-ec52b45be668": {"id": "040ddc06-50cb-4319-b3f6-ec52b45be668", "cost": "Free", "description": "This program is for Otsuka People Mangers. Ideal candidates are 1st year in role, at the Manager - Sr. Dir. level. But, anyone who has direct reports can benefit. The program is designed to help people leaders develop & sharpen their people leadership skills and practices. MTOW focuses on how managers think, because that impacts everything they do. MTOW aims to cultivate values, purpose, mindset, and communication through a variety of learning experiences and resources. Training time appx 40 hrs", "global_activity_url": null, "earn_this_badge_url": null, "enable_earn_this_badge": false, "enable_detail_attribute_visibility": true, "level": "Foundational", "name": "MTOW | Managing the Otsuka Way", "vanity_slug": "mtow-managing-the-otsuka-way", "time_to_earn": "Hours", "type_category": "Certification", "show_badge_lmi": false, "show_skill_tag_links": true, "translatable": false, "image": {"id": "1ef86077-4ff5-4742-8c5c-3a2ca2329dda", "url": "https://images.credly.com/images/1ef86077-4ff5-4742-8c5c-3a2ca2329dda/image.png"}, "image_url": "https://images.credly.com/images/1ef86077-4ff5-4742-8c5c-3a2ca2329dda/image.png", "url": "https://www.credly.com/org/otsuka/badge/mtow-managing-the-otsuka-way", "issuer": {"summary": "issued by Otsuka", "entities": [{"label": "Issued by", "primary": true, "entity": {"type": "Organization", "id": "47b1538d-f618-49e8-a6b5-43dac06b2c28", "name": "Otsuka", "url": "https://www.credly.com/api/v1/organizations/47b1538d-f618-49e8-a6b5-43dac06b2c28", "vanity_url": "https://www.credly.com/org/otsuka", "internationalize_badge_templates": false, "share_to_ziprecruiter": true, "verified": false}}]}, "alignments": [], "badge_template_activities": [{"id": "d6fc2c6d-38cf-4a3b-a013-a3b84e28adc4", "activity_type": "Course", "required_badge_template_id": null, "title": "Your Values - Your values create and shape how you interact and respond to people and the world. Knowing your key values helps you stay grounded and determine direction and lead with consistency and integrity. Learn to articulate your values and how to leverage them into your everyday leadership to inspire, motivate, and align your team.", "url": null}, {"id": "22fd2c6c-d699-4a95-820a-53d6d04842d8", "activity_type": "Course", "required_badge_template_id": null, "title": "Your Why - Your values connect to your Why. Your Why is integral to who you are and how you will defy limitation so others can too. You will begin to develop a statement of your Why. Being able to identify and align work to your Why is integral to creating a fulfilling work environment and experience for you and your team. Your will tie your values into the goals of the organization.", "url": null}, {"id": "28f96629-e13d-4500-948f-76ad9b7ace42", "activity_type": "Course", "required_badge_template_id": null, "title": "Mindset - mindset is key to how you approach challenges. Developing a growth mindset will help you overcome obstacles. Learn the difference between fixed and growth mindset and how to identify when you or a team member may be in a fixed mindset, and what tools and techniques can help turn fixed mindset to a growth mindset.", "url": null}, {"id": "37df698c-aee7-436f-8803-2e139a1fcd67", "activity_type": "Course", "required_badge_template_id": null, "title": "Habit Formation - Learn sustainable methods for developing new habits that will increase your effectiveness as a manager. We cover SMART goals, along with DAILY method for identifying a new habit and its benefits, and the CHANGE method for overcoming mental blocks and competing internal priorities that can impede the formation of a new good habit.", "url": null}, {"id": "e68afb59-e709-463f-8296-48d06d2585c6", "activity_type": "Course", "required_badge_template_id": null, "title": "DISC – DISC helps us to understand our work and communication style and preferences. It also helps us to identify these characteristics in others and adapt our communication styles to meet the needs of others, without changing the core and quality of our message. This improves communication, improves work efficiencies, and reduces interpersonal tensions.", "url": null}, {"id": "ea68dfd0-dc87-4d5d-8c10-e47001b28a43", "activity_type": "Course", "required_badge_template_id": null, "title": "EQ – Emotional intelligence helps improve our identification and management of emotions so we have the right impact at work. Practical strategies for improving all elements of EQ are explained and practical application at work is mapped out for execution.", "url": null}, {"id": "1d09a297-1c31-4d56-89fb-63110664b75b", "activity_type": "Course", "required_badge_template_id": null, "title": "Coaching & Feedback – Managers learn to utilize coaching to improve employee performance & engagement. Key behaviors utilized in coaching are learned as well as tools for improvement. Managers learn how to use powerful questions to help employees find solutions and a pathway to improved performance and career growth. Otsuka's feedback model is reviewed so managers can shape feedback so that employees continue to grow and apply their strengths as well as change behaviors that are not as effective", "url": null}, {"id": "4c83b6f6-c078-4458-b088-7bf5ed7ff530", "activity_type": "Course", "required_badge_template_id": null, "title": "Difficult Conversations – In this course, participants learn specific techniques that help them effectively approach and engage in difficult conversations. Participants learn how to prepare themselves and others for difficult conversations, listen non-judgmentally, find common ground, develop collaborative solutions, and prevent escalation - or de-escalate situations that may already be contentious. Participants leave with guides and practical approaches to a variety of conversations.", "url": null}, {"id": "fda98bee-36f9-4ef4-a9e4-624912329964", "activity_type": "Course", "required_badge_template_id": null, "title": "Leading Inclusively – Having every employee fully engaged and contributing to the work being done is critical for business success and it is the right thing to do. In this course participants learn how to cultivate an inclusive mindset and employ behaviors that create an inclusive work environment for all employees.", "url": null}, {"id": "c760f681-5f28-4eac-9052-3ae9a9dfa432", "activity_type": "Course", "required_badge_template_id": null, "title": "Leading Remotely - Participants learn best practices for staying connected when they cannot always be in the same room or time zone with their team. The focus of this session is building trust, rapport, and high-functioning teams in a remote/hybrid setting. While remote/hybrid work has become a natural part of the work landscape the behaviors to lead in this capacity need to be honed. Participants achieve this with a highly-interactive session facilitated by Dale Carnegie.", "url": null}, {"id": "af74dc20-e348-4613-9c3c-862c97cfa381", "activity_type": "Course", "required_badge_template_id": null, "title": "Development Planning – In this course, managers learn how to develop themselves, their careers, and support the development of others. The practical tools and processes learned help participants develop new skills in a time efficient way. This session utilizes the Otsuka Career Journey site, the ASPIRE competency model, and templates for reflecting on and planning GROW goals.", "url": null}, {"id": "e9ff4f0e-4db5-4377-8d86-61a48716a87c", "activity_type": "Course", "required_badge_template_id": null, "title": "Time/Calendar Management & Prioritization – Managing our time effectively helps us be more productive at work and helps us have a more balanced integration of work and life. In this course you will learn how to use specific calendar management techniques and tools so you can plan your work and make space for the most important work. You will also learn how to prioritize work for yourself and your team. This session focuses on practical tools and tips that can be applied immediately.", "url": null}], "endorsements": [], "skills": [{"id": "13322b2e-97ca-44c1-b96d-87545de8554f", "name": "Calendar Management", "vanity_slug": "calendar-management"}, {"id": "0e039e01-5a91-4980-9f7a-4812643ad284", "name": "Coaching", "vanity_slug": "coaching"}, {"id": "0cd5a594-819d-42d2-a457-3ac800b54dec", "name": "Communication", "vanity_slug": "communication"}, {"id": "77444b4d-7dc4-437e-98a7-fd1d35854e86", "name": "Difficult Conversation", "vanity_slug": "difficult-conversation"}, {"id": "fd7dfc4a-0537-45da-8625-15fe05b22243", "name": "Emotional Intelligence", "vanity_slug": "emotional-intelligence"}, {"id": "c6aae8f2-f642-4b82-8975-1317f859e041", "name": "Feedback", "vanity_slug": "feedback"}, {"id": "e1997c82-1780-480f-8f0c-fd394e3a0adb", "name": "Inclusive Leadership", "vanity_slug": "inclusive-leadership"}, {"id": "6eef727c-756c-4b23-8b73-ab8e05b31bd2", "name": "Leadership Development", "vanity_slug": "leadership-development"}, {"id": "d41c7e8d-ca6b-4c88-a812-dc52f9fa4636", "name": "Mindset", "vanity_slug": "mindset"}, {"id": "ad84eef4-28b5-4dae-ab8e-0fda57d6b211", "name": "People-focused Leadership", "vanity_slug": "people-focused-leadership"}, {"id": "7180656c-e5c3-46b1-bb59-4bf3d62d25b1", "name": "Prioritization", "vanity_slug": "prioritization"}, {"id": "41ef0c1a-851b-42ff-b6db-d61ed14d4617", "name": "Time Management", "vanity_slug": "time-management"}]}}